---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength.Direction
source: html/ac104515-67aa-8988-1197-ed1093b2ad28.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength.Direction Property

A vector specifying the direction of the constraint. The direction is fixed,
 and the shape is always constructed so that the segment
 direction has a positive dot product with this vector.

## Syntax (C#)
```csharp
public UV Direction { get; }
```